Revit 2027 API
Document.NewOpening(Wall, XYZ, XYZ) Method
 Creates a rectangular opening on a wall.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Opening NewOpening(
	Wall wall,
	XYZ pntStart,
	XYZ pntEnd
)
Public Function NewOpening (
	wall As Wall,
	pntStart As XYZ,
	pntEnd As XYZ
) As Opening
public:
Opening^ NewOpening(
	Wall^ wall,
	XYZ^ pntStart,
	XYZ^ pntEnd
)
member NewOpening :
        wall : Wall *
        pntStart : XYZ *
        pntEnd : XYZ -> Opening
Parameters
wall Wall
 Host element of the opening.
pntStart XYZ
One corner of the rectangle.
pntEnd XYZ
The opposite corner of the rectangle.
Return Value
Opening
 If successful, an Opening object is returned.
Exceptions
Exception | Condition
ArgumentException | Thrown if the wall does not exist in the given document, or if the wall doesn't support rectangular openings.
Remarks
Slanted stacked walls do not support rectangular openings.
See Also
Reference
Document Class
NewOpening Overload
Autodesk.Revit.Creation Namespace